#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Sun Nov 16 15:01:25 2025

set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/User/Files/project_self/OPHW_25H/workspace/14_HDMI_picture_grey/design/data_delay.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/14_HDMI_picture_grey/design/signal_delay.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/constraint/14_HDMI_picture_grey.fdc"
add_constraint "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/constraint/18_HDMI_picture_mid_filter.fdc"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/design/hdmi_picture_mid_filter.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/design/matrix_3x3.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/design/median_filter_3x3.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/design/sort3.v"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/design/RGB2YCbCr.v"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/design/hdmi_picture_grey.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
add_design E:/User/Files/project_self/OPHW_25H/workspace/18_HDMI_picture_mid_filter/project/ipcore/fifo_line_buf/fifo_line_buf.idf
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_mid_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/constraint/18_HDMI_picture_mid_filter.fdc"
add_constraint "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/constraint/19_HDMI_picture_aver_filter.fdc"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/design/aver_milter.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/design/hdmi_picture_aver_filter.v"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/design/hdmi_picture_mid_filter.v"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/design/median_filter_3x3.v"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/19_HDMI_picture_aver_filter/design/sort3.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/19_HDMI_picture_aver_filter/design/aver_filter.v"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/19_HDMI_picture_aver_filter/design/aver_milter.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_aver_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
