#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Sun Nov 16 15:01:25 2025

set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/area_bin.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/binarization.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/data_delay.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/signal_delay.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/matrix_3x3.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
add_design E:/User/Files/project_self/OPHW_25H/workspace/16work/project/ipcore/fifo_line_buf/fifo_line_buf.idf
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/matrix_3x3.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/design/matrix_3x3.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/matrix_3x3.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/matrix_tb.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/area_bin.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/asyn_rst_syn.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/binarization.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/data_delay.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/dvi_encoder.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/dvi_transmitter_top.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/hdmi_picture_grey.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/RGB2YCbCr.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/serializer_10_to_1.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/signal_delay.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/sync_vg.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/video_display.v"
add_simulation "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/top_tb.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/top_tb.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module top_tb
synthesize -ads -selected_syn_tool_opt 2 
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/16work/simulation/top_tb.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/User/Files/project_self/OPHW_25H/workspace/16work/project/synthesize/hdmi_picture_grey_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"E:/User/Files/project_self/OPHW_25H/workspace/16work/project/synthesize/hdmi_picture_grey_syn.fic"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/User/Files/project_self/OPHW_25H/workspace/16work/project/synthesize/hdmi_picture_grey_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic "E:/User/Files/project_self/OPHW_25H/workspace/16work/project/synthesize/hdmi_picture_grey_syn.fic"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/User/Files/project_self/OPHW_25H/workspace/16work/project/synthesize/hdmi_picture_grey_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"E:/User/Files/project_self/OPHW_25H/workspace/16work/project/synthesize/hdmi_picture_grey_syn.fic"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/constraint/14_HDMI_picture_grey.fdc"
add_constraint "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/constraint/16_HDMI_picture_binarization.fdc"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/design/hdmi_picture_grey.v"
add_design "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/design/hdmi_picture_binarization.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/top_tb.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/video_display.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/sync_vg.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/signal_delay.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/serializer_10_to_1.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/RGB2YCbCr.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/hdmi_picture_grey.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/dvi_transmitter_top.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/dvi_encoder.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/data_delay.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/binarization.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/asyn_rst_syn.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/area_bin.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/matrix_3x3.v"
remove_simulation "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/16_HDMI_picture_binarization/simulation/matrix_tb.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_binarization
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/constraint/16_HDMI_picture_binarization.fdc"
add_constraint "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/constraint/17_HDMI_picture__ero_dil.fdc"
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/design/hdmi_picture_binarization.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/design/dilate.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/design/erosion.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/design/hdmi_picture_ero_dil.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/design/matrix_3x3_1bit.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
synthesize -ads -selected_syn_tool_opt 2 
add_design E:/User/Files/project_self/OPHW_25H/workspace/17_HDMI_picture__ero_dil/project/ipcore/fifo_line_buf_1bit/fifo_line_buf_1bit.idf
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/17_HDMI_picture_ero_dil/constraint/17_HDMI_picture__ero_dil.fdc"
add_constraint "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/17_HDMI_picture_ero_dil/constraint/17_HDMI_picture_ero_dil.fdc"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_ero_dil
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Advanced/17_HDMI_picture_ero_dil/design/matrix_3x3_1bit.v"
