#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Sun Nov 16 15:01:25 2025

set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/User/Files/project_self/OPHW_25H/workspace/14_HDMI_picture_grey/design/data_delay.v"
add_design "E:/User/Files/project_self/OPHW_25H/workspace/14_HDMI_picture_grey/design/signal_delay.v"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_picture_grey
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
