#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Fri Nov 14 13:01:51 2025

set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Basic/09_hdmi_colorbar/constraint/05_hdmi_colorbar.fdc"
add_constraint "E:/User/Files/project_self/OPHW_25H/OPHW_25H_TEST/1_Demo/Basic/09_hdmi_colorbar/constraint/09_hdmi_colorbar.fdc"
set_arch -family Logos2 -device PG2L25H -speedgrade -6 -package MBG325
compile -top_module hdmi_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
